
COMMANDE CISCO :
*******************
enable :                                      Mode privilégier
configure terminal :                          Mode conf global
interface FastEthernet 0/1 :                  Mode conf int
hostname nom_hote :                           Donner un nom à l'hote
hostname ? :                                  Afficher l'aide de la commande hostname

show running-config :                         Afficher la conf
banner login % :                              Ajouter une bannière
show interfaces :                             Afficher les int
no shutdown :                                 Activer l'int
ip address @_IP Masque :                      Attribuer une IP et un masque
copy running-config startup-config :          Save les modifs

LES VLAN :
***********
vlan 1 :                                       Créer le vlan 1
no vlan 1 :                                    Supprimer le vlan 1

Configuration d'un vlan :
===========================
switch(config)# vlan 2 (pour entrer en mode configuration vlan)

switch(config-vlan)# name e-commerce (pour lui donner un nom)

switch(config-vlan)# state active

switch(config-vlan)# no shutdown (pour l’activer)

Attribuer un port :
=====================
switch(config)# interface gigabitethernet 0/0/0 (on passe sur l’interface voulue)

switch(config-if)# switchport access vlan 2 (on ajoute le VLAN)

Configuration du mode Trunk :
===============================
switch1# configure terminal

switch1(config)# interface GigabitEthernet 0/1

switch1(config-if)#switchport trunk encapsulation dot1q

switch1(config-if)# switchport mode trunk

switch1(config-if)# switchport trunk allow vlan 2-3


VLAN ET INTERNET :
********************
Router1#configure terminal

Router1(config)#int gigabitEthernet 0/0/0 
Router1(config-if)#no shut
Router1(config-if)#exit

!-- On créé la sub-interface et on la déclare comme étant le VLAN 1 et le VLAN natif

Router1(config)#int gigabitEthernet 0/0/0.1

Router1(config-subif)#encapsulation dot1Q 1 native

Router1(config-subif)#ip address 192.168.1.254 255.255.255.0
Router1(config-subif)#exit

!-- On créé le sub-interface et on la déclare comme étant le VLAN 2

Router1(config)#int fastEthernet 0/0/0.2

Router1(config-subif)#encapsulation dot1Q 2

Router1(config-subif)#ip address 192.168.2.254 255.255.255.0
Router1(config-subif)#exit

!-- On créé le sub-interface et on la déclare comme étant le VLAN 99

Router1(config)#int fastEthernet 0/0/0.99

Router1(config-subif)#encapsulation dot1Q 99

Router1(config-subif)#ip address 192.168.99.254 255.255.255.0
Router1(config-subif)#exit

MISE EN PLACE NTP (Network Time Protocole) :
**********************************************
ntp master 1
end

conf t :                                           Mode conf
ntp server @_IP :                                  Ajout du server ntp sur l'int @_IP
exit :                                             Quitter

sh ntp associations :                              Voir quel matériel sont associé
sh ntp associations detail :                       Afficher les détails sur le serv
sh clock detail :                                  Montre la source de l'horloge





























